Websites/Ruby_on_rails/friends/app/controllers/friends_controller.rb

  def index
    @friends = Friend.all
---
SELECT "friends".* FROM "friends"

  def create
    @friend = current_user.friends.build(friend_params)
    #@friend = Friend.new
    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "twitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["twitter", "Nemtom"], ["updated_at", "2022-08-21 15:38:33.855097"], ["id", 3]]

  def destroy
    @friend.destroy
---
DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 4]]

  def correct_user
    @friend = current_user.friends.find_by(id: params[:id])
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ? AND "friends"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]

    def set_friend
      @friend = Friend.find(params[:id])
---
SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]